Rhino.Inside.Revit API
GeometryDecoder.ToPoint3d Method
 Converts the specified Autodesk.Revit.DB.XYZ to an equivalent Rhino.Geometry.Point3d.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.Point3d ToPoint3d(
	this Autodesk.Revit.DB.XYZ point
)
@staticmethod
def ToPoint3d(
	point: Autodesk.Revit.DB.XYZ
) -> Rhino.Geometry.Point3d
Parameters
point
Type: Autodesk.Revit.DB.XYZ
Revit point to convert.
Return Value
Type: Rhino.Geometry.Point3d
Rhino point that is equivalent to the provided Revit point.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.XYZ. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPoint3d(XYZ) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Point3d rhinoPoint3d = revitPoint.ToPoint3d();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_point3d = revit_point.ToPoint3d() # type: RG.Point3d
 Using ToPoint3d(XYZ) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Point3d rhinoPoint3d = GeometryEncoder.ToPoint3d(revitPoint)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_point3d = GD.ToPoint3d(revit_point) # type: RG.Point3d
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace